Autodesk.Revit.DB.Structure.FabricSheet.IsSingleFabricSheetWithinHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Identifies if the specified single Fabric Sheet position is within the host.
hostElement:
A structural element that will host the Fabric Sheet.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Returns:
True if the single Fabric Sheet instance is within the host, false if the single Fabric Sheet instance is out of host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.SetUnobscuredInView(Autodesk.Revit.DB.View,System.Boolean)
Sets this fabric sheet to be shown unobscured in a view.
view:
The view element
unobscured:
True if fabric sheet is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.IsUnobscuredInView(Autodesk.Revit.DB.View)
Checks if this fabric sheet is shown unobscured in a view.
view:
The view element
Returns:
True if fabric sheet is shown unobscured, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This fabric sheet doesn't have valid visibility data.
Since:
2021

Autodesk.Revit.DB.Structure.FabricSheet.SetSegmentLength(Autodesk.Revit.DB.ElementId,System.Double)
Sets the value of the bent fabric sheet segment(like A, B, C, D etc.)
segmentParameterId:
The segment ID of the bent fabric sheet.
value:
The length value to set
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for value is not a number
-or-
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for value must be between 0 and 30000 feet.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.SetBendProfile(Autodesk.Revit.DB.CurveLoop)
Sets new profile that defines the shape of the Fabric Sheet bending.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.GetReinforcementRoundingManager
Returns an object for managing reinforcement rounding override settings.
Returns:
The rounding manager.
Since:
2014

Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost(Autodesk.Revit.DB.Element)
Checks whether an element is a valid host for fabric sheet.
host:
The element to check.
Returns:
True if the element is a valid host for fabric sheet, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.IsValidHost(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether an element is a valid host for fabric sheet.
document:
The document.
concreteHostElementId:
The elementId to check.
Returns:
True if the element is a valid host for fabric sheet, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheet.PlaceInHost(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Transform)
Inserts the single Fabric Sheet instance into the host element.
hostElement:
A structural element that will host the Fabric Sheet. The element must support fabric hosting.
transform:
The transform that defines the placement of the instance single Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The host Element is not a valid host for Fabric Sheet.
-or-
transform defines the placement out of the host.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
transform is not conformal.
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.CurveLoop)
Creates a new instance of a single bent Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
concreteHostElementId:
The element that will host the FabricSheet.
The host can be a Structural Floor, Structural Wall, Structural Slab, Structural Floor Edge, Structural Slab Edge,
Structural Column, Beam and Brace.
Also, host can be a Autodesk::Revit::DB::Part created from a structural layer of Structural Floor, Structural Wall or Structural Slab.
fabricSheetTypeId:
The id of the FabricSheetType.
bendProfile:
A profile that defines the bending shape of the fabric sheet.
The profile can be provided without fillets (eg. for L shape, only two lines not two lines and one arc), if so,
then fillets (in example one arc) will be automatically generated basing on the Bend Diameter parameter defined in the Fabric Wire system family.
If the provided profile has no corners (has a tangent defined at each point except the ends), no fillets will be generated.
The provided profile defines the center-curve of a wire.
Returns:
The instance of the newly created bent fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
concreteHostElementId is not a valid ElementId for the host Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
-or-
Thrown when the bend profile contains an overlap or intersecting segments.
-or-
Thrown when the bend profile is empty.
-or-
Thrown when the bend profile contains an empty loop.
-or-
Thrown when the bend profile contains multiple loops.
-or-
Thrown when the bend profile contains a closed loop.
-or-
Thrown when the bend profile contains two or more arcs that are not separated from one another by a straight segment.
-or-
Thrown when the bend profile contains too short segments which prevent the fillets from being added. The fillet radius is taken from Bend Diameter parameter defined in the Fabric Wire system family.
-or-
Thrown when the provided profile cannot be used as a bending shape for this fabric sheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId)
Creates a new instance of a single flat Fabric Sheet element within the project.
document:
The document in which the fabric sheet is to be created.
hostElement:
The element that will host the FabricSheet. The host can be a Structural Floor, Structural Wall, Structural Slab, or a Part created from a structural layer belonging to one of those element types.
fabricSheetTypeId:
The id of the FabricSheetType.
Returns:
The newly created single Fabric Sheet instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element hostElement was not found in the given document.
-or-
The host Element is not a valid host for Fabric Sheet.
-or-
fabricSheetTypeId should refer to an FabricSheetType element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.FabricHostReference
Controls if Single Fabric Sheet should be cut by the Host Cover
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.CoverOffset
The additional cover offset of the Fabric Sheet.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for coverOffset is not a number
-or-
When setting this property: coverOffset is greater then the host thickness.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for coverOffset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.FabricLocation
The Fabric Sheet location in the host.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property:
Since:
2015

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricLongitudinalCutLength
Specifies the cut length of the fabric sheet perpendicular to the bend edge.
Remarks:
Zero indicates that the fabric sheet is not shortened.
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for bentFabricLongitudinalCutLength must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricStraightWiresLocation
Specifies the location of straight bars with respect to bent bars in the fabric sheet.
Remarks:
This parameter applies only to bent fabric sheets.
The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricBendDirection
Specifies which wire direction of the fabric sheet is bent.
Remarks:
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016